Revit 2026 API

# TriangulatedShellComponent Class

---

This class represents a triangulated boundary component of a solid or a triangulated connected component of a shell.

SystemObject Autodesk.Revit.DBTriangulatedShellComponent

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class TriangulatedShellComponent : IDisposable
```
```vb
Public Class TriangulatedShellComponent
	Implements IDisposable
```
```cpp
public ref class TriangulatedShellComponent : IDisposable
```
```fsharp
type TriangulatedShellComponent =
    class
        interface IDisposable
    end
```

The TriangulatedShellComponent type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsClosed | True if and only if the triangulation represents a topologically closed shell (i.e., each edge is shared by two triangles). |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | TriangleCount | The number of triangles in the triangulation. |
|  | VertexCount | The number of vertices in the triangulation. |

|  | Name | Description |
| --- | --- | --- |
|  | Clear | Empties the contents of this TriangulatedShellComponent. |
|  | Dispose | Releases all resources used by the TriangulatedShellComponent |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetTriangle | Returns the triangle corresponding to the given index. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | GetVertex | Returns the vertex with a given index. |
|  | GetVertices | Returns the vertices of the triangulation. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

The triangulation is "topologically connected" in the following sense: if two triangles share an edge geometrically, then they share a single edge topologically (i.e., they share two vertices defining the geometrically shared edge).

#### Reference

Autodesk.Revit.DB Namespace